In [1]:
import psycopg2
import sys, os
import numpy as np
import pandas as pd
import pandas.io.sql as psql
from sqlalchemy import create_engine
from sklearn.metrics import r2_score
from sklearn.model_selection import cross_val_score, GridSearchCV, cross_validate, train_test_split
from sklearn.metrics import accuracy_score, classification_report
from sklearn.svm import SVC
from sklearn.linear_model import LinearRegression
from sklearn.neural_network import MLPClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import StandardScaler, normalize
from sklearn.decomposition import PCA
from sklearn.svm import SVR
from IPython.display import display
from sklearn.metrics import mean_squared_error
from math import sqrt

In [2]:
url = 'postgresql://{user}:{passwd}@{host}:{port}/{db}'.format(
         user="cse6242", passwd="cse6242", host="localhost", port=5432, db="cse6242")

engine = create_engine(url, pool_size=50)

engine.connect()
connection = engine.connect() 
query = "SELECT county_id, home_type_id, year_month, index_value from county_timeseries"

df = pd.read_sql(query, con=connection)

df.rename(columns = {'year_month':'year'}, inplace = True)
df[['year','month']] = df['year'].str.split('-',expand=True)

cols = df.columns.tolist() 
new_cols = [x for x in cols if x != cols[-2]] + [cols[-2]]
df = df[new_cols]
df.fillna(method="ffill", inplace=True)
df.fillna(method="bfill", inplace=True)
random_state = 100
x_data = df.loc[:, df.columns != "index_value"]
y_data = df.loc[:, "index_value"]

In [3]:
display(df)

         county_id  home_type_id  year month  index_value
0              142             1  1996    04     138100.0
1              142             1  1996    05     137800.0
2              142             1  1996    06     137600.0
3              142             1  1996    07     137300.0
4              142             1  1996    08     137000.0
...            ...           ...   ...   ...          ...
2789789       2593             8  2019    02       1059.0
2789790       2593             8  2019    03       1060.0
2789791       2593             8  2019    04       1062.0
2789792       2593             8  2019    05       1042.0
2789793       2593             8  2019    06       1026.0

[2789794 rows x 5 columns]

In [4]:

# df, x_vals, y_vals

random_state = 100

x_train, x_test, y_train, y_test = train_test_split(x_data, y_data, test_size=0.25, shuffle=True, random_state=random_state)

In [5]:
# crime_data_query = """
# SELECT zipcode_id, violent_crime, property_crime, county_id
# from crime_data as c, zipcode as z
# WHERE c.zipcode_id::text = z.zip_code

# """

crime_data_query = """
select zipcode_id, violent_crime, property_crime, county_id from crime_data
inner join zipcode on crime_data.zipcode_id = zipcode.id;
"""

crime_data_df = pd.read_sql(crime_data_query, con=connection)

display(crime_data_df)

       zipcode_id  violent_crime  property_crime  county_id
0               1           33.9            35.8       1969
1               2           15.8            23.4        174
2               3           24.0            30.1       1178
3               4           20.1            26.4        347
4               5            5.0             6.0        607
...           ...            ...             ...        ...
32142       33412           27.6            29.0       2083
32143       33413           17.8            22.6       3080
32144       33414           20.4            23.5       2869
32145       33415           26.0            30.9       1802
32146       33416            9.8            24.5       2659

[32147 rows x 4 columns]

In [6]:
# school_data_query = """
# SELECT zipcode_id, schooldigger_rating, average_standard_score, county_id
# from school_data as s, zipcode as z
# WHERE s.zipcode_id::text = z.zip_code

# """

school_data_query = """
select zipcode_id, schooldigger_rating, average_standard_score, county_id
from school_data
inner join zipcode on school_data.zipcode_id = zipcode.id;
"""

school_data_df = pd.read_sql(school_data_query, con=connection)

display(school_data_df)

       zipcode_id  schooldigger_rating  average_standard_score  county_id
0               2                  5.0                    87.8        174
1               3                  4.0                    82.4       1178
2               3                  4.0                    89.4       1178
3               3                  2.0                    33.0       1178
4               3                  3.0                    60.6       1178
...           ...                  ...                     ...        ...
99290       33412                  4.0                    68.9       2083
99291       33412                  1.0                    32.1       2083
99292       33413                  2.0                    55.0       3080
99293       33413                  4.0                    69.2       3080
99294       33413                  4.0                    66.2       3080

[99295 rows x 4 columns]

In [7]:
school_ratings_by_county = school_data_df.groupby(['county_id']).mean()
school_ratings_by_county["zip_code"] = school_ratings_by_county.index

In [8]:
crime_rate_by_county = crime_data_df.groupby(['county_id']).mean()
crime_rate_by_county["zip_code"] = crime_rate_by_county.index

In [9]:
# school_ratings_by_county.drop(columns=["zipcode_id", "zip_code"])
del school_ratings_by_county["zipcode_id"]
del school_ratings_by_county["zip_code"]
school_ratings_by_county["county_id"] = school_ratings_by_county.index
display(school_ratings_by_county)

           schooldigger_rating  average_standard_score  county_id
county_id
1                     2.210884               44.650340          1
2                     2.666667               55.466667          2
3                     3.000000               55.866667          3
4                     1.257576               25.532353          4
5                     2.714286               51.675000          5
...                        ...                     ...        ...
3140                  2.166667               40.125000       3140
3141                  2.833333               55.966667       3141
3142                  3.166667               62.683333       3142
3143                  1.000000               17.700000       3143
3144                  1.650000               37.440000       3144

[3096 rows x 3 columns]

In [10]:
del crime_rate_by_county["zipcode_id"]
del crime_rate_by_county["zip_code"]
crime_rate_by_county["county_id"] = crime_rate_by_county.index

display(crime_rate_by_county)

           violent_crime  property_crime  county_id
county_id
1              50.626531       58.024490          1
2              14.950000       19.950000          2
3              30.900000       36.300000          3
4              53.066667       65.388889          4
5              17.408333       22.841667          5
...                  ...             ...        ...
3140           25.157143       31.314286       3140
3141           16.366667       19.988889       3141
3142           40.900000       47.300000       3142
3143           50.350000       54.550000       3143
3144           15.616667       24.066667       3144

[3101 rows x 3 columns]

In [11]:
# school_ratings_by_zipcode[school_ratings_by_zipcode["zip_code"] == "4762"]

# zipcode_data_query = "SELECT zip_code, county_id from zipcode"

# zipcode_data_df = pd.read_sql(zipcode_data_query, con=connection)

# display(zipcode_data_df)

# # school_data_df.join(zipcode_data_df)
# display(school_ratings_by_zipcode)
# school_ratings_by_zipcode["zip_code"] = school_ratings_by_zipcode["zip_code"].astype(str)

# zipcode_data_df["zip_code"] = zipcode_data_df["zip_code"].astype(str)

# county_school_rating = pd.merge(school_ratings_by_zipcode, zipcode_data_df, how="outer")

# display(county_school_rating)

# county_school_rating[county_school_rating["zip_code"] == "4762"]

# school_data_df

# zipcode_data_df

# pd.merge(school_data_df, zipcode_data_df, how="inner", left_on="zipcode_id", right_on="zip_code")

In [12]:
# np.corrcoef(df["index_value"], school_ratings_by_county["schooldigger_rating"])
# dl school_ratings_by_county['index']
school_ratings_by_county = school_ratings_by_county.rename_axis(None)
final_school_rating_and_home_prices_df = pd.merge(school_ratings_by_county, df, how="inner")

In [13]:
crime_rate_by_county = crime_rate_by_county.rename_axis(None)
final_crime_rate_by_county_and_home_prices_df = pd.merge(crime_rate_by_county, df, how="inner")

In [14]:
display(final_crime_rate_by_county_and_home_prices_df)

,violent_crime,property_crime,county_id,home_type_id,year,month,index_value
0,50.626531,58.024490,1,1,1996,04,50800.0
1,50.626531,58.024490,1,1,1996,05,50900.0
2,50.626531,58.024490,1,1,1996,06,51000.0
3,50.626531,58.024490,1,1,1996,07,51200.0
4,50.626531,58.024490,1,1,1996,08,51500.0
...,...,...,...,...,...,...,...
2775853,15.616667,24.066667,3144,7,2019,05,805.0
2775854,15.616667,24.066667,3144,7,2019,06,795.0
2775855,15.616667,24.066667,3144,7,2019,07,789.0
2775856,15.616667,24.066667,3144,7,2019,08,786.0
2775857,15.616667,24.066667,3144,7,2019,09,787.0

In [15]:
display(final_school_rating_and_home_prices_df)

,schooldigger_rating,average_standard_score,county_id,home_type_id,year,month,index_value
0,2.210884,44.65034,1,1,1996,04,50800.0
1,2.210884,44.65034,1,1,1996,05,50900.0
2,2.210884,44.65034,1,1,1996,06,51000.0
3,2.210884,44.65034,1,1,1996,07,51200.0
4,2.210884,44.65034,1,1,1996,08,51500.0
...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144,7,2019,05,805.0
2775641,1.650000,37.44000,3144,7,2019,06,795.0
2775642,1.650000,37.44000,3144,7,2019,07,789.0
2775643,1.650000,37.44000,3144,7,2019,08,786.0
2775644,1.650000,37.44000,3144,7,2019,09,787.0

In [16]:
# final_school_rating_and_home_prices_df[final_school_rating_and_home_prices_df]
final_school_rating_and_home_prices_df[final_school_rating_and_home_prices_df.isnull().any(axis=1)]

,schooldigger_rating,average_standard_score,county_id,home_type_id,year,month,index_value
59802,NaN,NaN,80,3,2004,10,103100.0
59803,NaN,NaN,80,3,1996,04,359600.0
59804,NaN,NaN,80,3,1996,05,359600.0
59805,NaN,NaN,80,3,1996,06,359600.0
59806,NaN,NaN,80,3,1996,07,359600.0
...,...,...,...,...,...,...,...
2756965,NaN,NaN,3122,7,2019,05,1701.0
2756966,NaN,NaN,3122,7,2019,06,1732.0
2756967,NaN,NaN,3122,7,2019,07,1757.0
2756968,NaN,NaN,3122,7,2019,08,1783.0
2756969,NaN,NaN,3122,7,2019,09,1800.0

In [17]:
final_school_rating_and_home_prices_df = final_school_rating_and_home_prices_df.dropna()

In [18]:
final_crime_rate_by_county_and_home_prices_df = final_crime_rate_by_county_and_home_prices_df.dropna()

In [19]:
# final_school_rating_and_home_prices_df[final_school_rating_and_home_prices_df]
final_school_rating_and_home_prices_df[final_school_rating_and_home_prices_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [schooldigger_rating, average_standard_score, county_id, home_type_id, year, month, index_value]
Index: []

In [20]:
np.corrcoef(final_school_rating_and_home_prices_df["schooldigger_rating"], final_school_rating_and_home_prices_df["index_value"])

array([[1.        , 0.10980488],
       [0.10980488, 1.        ]])

In [21]:
np.corrcoef(final_school_rating_and_home_prices_df["average_standard_score"], final_school_rating_and_home_prices_df["average_standard_score"])

array([[1., 1.],
       [1., 1.]])

In [22]:
display(final_crime_rate_by_county_and_home_prices_df)

,violent_crime,property_crime,county_id,home_type_id,year,month,index_value
0,50.626531,58.024490,1,1,1996,04,50800.0
1,50.626531,58.024490,1,1,1996,05,50900.0
2,50.626531,58.024490,1,1,1996,06,51000.0
3,50.626531,58.024490,1,1,1996,07,51200.0
4,50.626531,58.024490,1,1,1996,08,51500.0
...,...,...,...,...,...,...,...
2775853,15.616667,24.066667,3144,7,2019,05,805.0
2775854,15.616667,24.066667,3144,7,2019,06,795.0
2775855,15.616667,24.066667,3144,7,2019,07,789.0
2775856,15.616667,24.066667,3144,7,2019,08,786.0
2775857,15.616667,24.066667,3144,7,2019,09,787.0

In [23]:
np.corrcoef(final_crime_rate_by_county_and_home_prices_df["violent_crime"], final_crime_rate_by_county_and_home_prices_df["index_value"])

array([[ 1.        , -0.05495788],
       [-0.05495788,  1.        ]])

In [24]:
np.corrcoef(final_crime_rate_by_county_and_home_prices_df["property_crime"], final_crime_rate_by_county_and_home_prices_df["index_value"])

array([[ 1.        , -0.01543986],
       [-0.01543986,  1.        ]])

In [25]:
from sklearn.metrics import mean_squared_error
from sklearn.ensemble import RandomForestRegressor
from math import sqrt

regr = RandomForestRegressor(max_depth=None, random_state=0,
                             n_estimators=100)


x_data = final_school_rating_and_home_prices_df.loc[:, final_school_rating_and_home_prices_df.columns != "index_value"]
y_data = final_school_rating_and_home_prices_df.loc[:, "index_value"]

In [26]:
x_train, x_test, y_train, y_test = train_test_split(x_data, y_data, test_size=0.25, shuffle=True, random_state=random_state)

In [27]:
x_data.size, x_train.size, x_test.size

(16542528, 12406896, 4135632)

In [28]:
regr.fit(x_train, y_train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=100,
                      n_jobs=None, oob_score=False, random_state=0, verbose=0,
                      warm_start=False)

In [29]:
y_pred = regr.predict(x_train)
rmse_random_forest_train = sqrt(mean_squared_error(y_train, y_pred))
print(rmse_random_forest_train)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_train.index.copy())
df_out_random_forest_train = pd.merge(final_school_rating_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_train)

2406.83776956596

,schooldigger_rating,average_standard_score,county_id,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1,1,1996,04,50800.0,NaN
1,2.210884,44.65034,1,1,1996,05,50900.0,50978.00
2,2.210884,44.65034,1,1,1996,06,51000.0,51035.00
3,2.210884,44.65034,1,1,1996,07,51200.0,NaN
4,2.210884,44.65034,1,1,1996,08,51500.0,51852.00
...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144,7,2019,05,805.0,NaN
2775641,1.650000,37.44000,3144,7,2019,06,795.0,NaN
2775642,1.650000,37.44000,3144,7,2019,07,789.0,795.19
2775643,1.650000,37.44000,3144,7,2019,08,786.0,NaN
2775644,1.650000,37.44000,3144,7,2019,09,787.0,791.84

In [30]:
y_pred = regr.predict(x_test)
rmse_random_forest_test = sqrt(mean_squared_error(y_test, y_pred))
print(rmse_random_forest_test)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_test.index.copy())
df_out_random_forest_test = pd.merge(final_school_rating_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_test)

5507.077901700601

,schooldigger_rating,average_standard_score,county_id,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1,1,1996,04,50800.0,51282.00
1,2.210884,44.65034,1,1,1996,05,50900.0,NaN
2,2.210884,44.65034,1,1,1996,06,51000.0,NaN
3,2.210884,44.65034,1,1,1996,07,51200.0,51376.00
4,2.210884,44.65034,1,1,1996,08,51500.0,NaN
...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144,7,2019,05,805.0,810.14
2775641,1.650000,37.44000,3144,7,2019,06,795.0,799.98
2775642,1.650000,37.44000,3144,7,2019,07,789.0,NaN
2775643,1.650000,37.44000,3144,7,2019,08,786.0,793.95
2775644,1.650000,37.44000,3144,7,2019,09,787.0,NaN

In [31]:
final_df_out = df_out_random_forest_train['y_pred'].combine_first(df_out_random_forest_test['y_pred'])

display(final_df_out)

0          51282.00
1          50978.00
2          51035.00
3          51376.00
4          51852.00
             ...
2775640      810.14
2775641      799.98
2775642      795.19
2775643      793.95
2775644      791.84
Name: y_pred, Length: 2757088, dtype: float64

In [32]:
y_hats_df = pd.DataFrame(data = final_df_out, columns = ['y_pred'], index = df.index.copy())
display(y_hats_df)
final_df_out = pd.merge(final_school_rating_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(final_df_out)

          y_pred
0        51282.0
1        50978.0
2        51035.0
3        51376.0
4        51852.0
...          ...
2789789      NaN
2789790      NaN
2789791      NaN
2789792      NaN
2789793      NaN

[2789794 rows x 1 columns]

,schooldigger_rating,average_standard_score,county_id,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1,1,1996,04,50800.0,51282.00
1,2.210884,44.65034,1,1,1996,05,50900.0,50978.00
2,2.210884,44.65034,1,1,1996,06,51000.0,51035.00
3,2.210884,44.65034,1,1,1996,07,51200.0,51376.00
4,2.210884,44.65034,1,1,1996,08,51500.0,51852.00
...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144,7,2019,05,805.0,810.14
2775641,1.650000,37.44000,3144,7,2019,06,795.0,799.98
2775642,1.650000,37.44000,3144,7,2019,07,789.0,795.19
2775643,1.650000,37.44000,3144,7,2019,08,786.0,793.95
2775644,1.650000,37.44000,3144,7,2019,09,787.0,791.84

In [33]:
regr = RandomForestRegressor(max_depth=None, random_state=0,
                             n_estimators=100)


x_data = final_crime_rate_by_county_and_home_prices_df.loc[:, final_crime_rate_by_county_and_home_prices_df.columns != "index_value"]
y_data = final_crime_rate_by_county_and_home_prices_df.loc[:, "index_value"]

In [34]:
x_train, x_test, y_train, y_test = train_test_split(x_data, y_data, test_size=0.25, shuffle=True, random_state=random_state)

In [35]:
x_data.size, x_train.size, x_test.size

(16655148, 12491358, 4163790)

In [36]:
regr.fit(x_train, y_train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=100,
                      n_jobs=None, oob_score=False, random_state=0, verbose=0,
                      warm_start=False)

In [37]:
y_pred = regr.predict(x_train)
rmse_random_forest_train = sqrt(mean_squared_error(y_train, y_pred))
print(rmse_random_forest_train)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_train.index.copy())
df_out_random_forest_train = pd.merge(final_crime_rate_by_county_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_train)


y_pred = regr.predict(x_test)
rmse_random_forest_test = sqrt(mean_squared_error(y_test, y_pred))
print(rmse_random_forest_test)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_test.index.copy())
df_out_random_forest_test = pd.merge(final_crime_rate_by_county_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_test)


final_df_out_2 = df_out_random_forest_train['y_pred'].combine_first(df_out_random_forest_test['y_pred'])

display(final_df_out_2)

y_hats_df = pd.DataFrame(data = final_df_out_2, columns = ['y_pred'], index = df.index.copy())
display(y_hats_df)
final_df_out_2 = pd.merge(final_crime_rate_by_county_and_home_prices_df, y_hats_df, how = 'left', left_index = True, right_index = True)

display(final_df_out_2)

2213.528747005982

,violent_crime,property_crime,county_id,home_type_id,year,month,index_value,y_pred
0,50.626531,58.024490,1,1,1996,04,50800.0,NaN
1,50.626531,58.024490,1,1,1996,05,50900.0,51103.00
2,50.626531,58.024490,1,1,1996,06,51000.0,51143.00
3,50.626531,58.024490,1,1,1996,07,51200.0,NaN
4,50.626531,58.024490,1,1,1996,08,51500.0,51675.00
...,...,...,...,...,...,...,...,...
2775853,15.616667,24.066667,3144,7,2019,05,805.0,NaN
2775854,15.616667,24.066667,3144,7,2019,06,795.0,NaN
2775855,15.616667,24.066667,3144,7,2019,07,789.0,792.90
2775856,15.616667,24.066667,3144,7,2019,08,786.0,NaN
2775857,15.616667,24.066667,3144,7,2019,09,787.0,787.76

5463.461414537578

,violent_crime,property_crime,county_id,home_type_id,year,month,index_value,y_pred
0,50.626531,58.024490,1,1,1996,04,50800.0,51240.00
1,50.626531,58.024490,1,1,1996,05,50900.0,NaN
2,50.626531,58.024490,1,1,1996,06,51000.0,NaN
3,50.626531,58.024490,1,1,1996,07,51200.0,51357.00
4,50.626531,58.024490,1,1,1996,08,51500.0,NaN
...,...,...,...,...,...,...,...,...
2775853,15.616667,24.066667,3144,7,2019,05,805.0,817.18
2775854,15.616667,24.066667,3144,7,2019,06,795.0,805.82
2775855,15.616667,24.066667,3144,7,2019,07,789.0,NaN
2775856,15.616667,24.066667,3144,7,2019,08,786.0,788.66
2775857,15.616667,24.066667,3144,7,2019,09,787.0,NaN

0          51240.00
1          51103.00
2          51143.00
3          51357.00
4          51675.00
             ...
2775853      817.18
2775854      805.82
2775855      792.90
2775856      788.66
2775857      787.76
Name: y_pred, Length: 2775858, dtype: float64

          y_pred
0        51240.0
1        51103.0
2        51143.0
3        51357.0
4        51675.0
...          ...
2789789      NaN
2789790      NaN
2789791      NaN
2789792      NaN
2789793      NaN

[2789794 rows x 1 columns]

,violent_crime,property_crime,county_id,home_type_id,year,month,index_value,y_pred
0,50.626531,58.024490,1,1,1996,04,50800.0,51240.00
1,50.626531,58.024490,1,1,1996,05,50900.0,51103.00
2,50.626531,58.024490,1,1,1996,06,51000.0,51143.00
3,50.626531,58.024490,1,1,1996,07,51200.0,51357.00
4,50.626531,58.024490,1,1,1996,08,51500.0,51675.00
...,...,...,...,...,...,...,...,...
2775853,15.616667,24.066667,3144,7,2019,05,805.0,817.18
2775854,15.616667,24.066667,3144,7,2019,06,795.0,805.82
2775855,15.616667,24.066667,3144,7,2019,07,789.0,792.90
2775856,15.616667,24.066667,3144,7,2019,08,786.0,788.66
2775857,15.616667,24.066667,3144,7,2019,09,787.0,787.76

In [38]:
school_and_crime_home_price_prediction = pd.merge(school_ratings_by_county, crime_rate_by_county, how="inner")

In [39]:
school_and_crime_home_price_prediction = pd.merge(school_and_crime_home_price_prediction, df, how="inner")

In [40]:
school_and_crime_home_price_prediction

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month,index_value
0,2.210884,44.65034,1,50.626531,58.024490,1,1996,04,50800.0
1,2.210884,44.65034,1,50.626531,58.024490,1,1996,05,50900.0
2,2.210884,44.65034,1,50.626531,58.024490,1,1996,06,51000.0
3,2.210884,44.65034,1,50.626531,58.024490,1,1996,07,51200.0
4,2.210884,44.65034,1,50.626531,58.024490,1,1996,08,51500.0
...,...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144,15.616667,24.066667,7,2019,05,805.0
2775641,1.650000,37.44000,3144,15.616667,24.066667,7,2019,06,795.0
2775642,1.650000,37.44000,3144,15.616667,24.066667,7,2019,07,789.0
2775643,1.650000,37.44000,3144,15.616667,24.066667,7,2019,08,786.0
2775644,1.650000,37.44000,3144,15.616667,24.066667,7,2019,09,787.0

In [41]:
print(school_and_crime_home_price_prediction.shape)
school_and_crime_home_price_prediction.dropna()
print(school_and_crime_home_price_prediction.shape)

(2775645, 9)
(2775645, 9)

In [42]:
regr = RandomForestRegressor(max_depth=None, random_state=0,
                             n_estimators=100)
def clean_dataset(df):
    df.dropna(inplace=True)
    indices_to_keep = ~df.isin([np.nan, np.inf, -np.inf]).any(1)
    return df[indices_to_keep].astype(np.float64)  # convert to float64 to avoid error

school_and_crime_home_price_prediction = clean_dataset(school_and_crime_home_price_prediction)

x_data = school_and_crime_home_price_prediction.loc[:, school_and_crime_home_price_prediction.columns != "index_value"]
y_data = school_and_crime_home_price_prediction.loc[:, "index_value"]

In [43]:
x_train, x_test, y_train, y_test = train_test_split(x_data, y_data, test_size=0.25, shuffle=True, random_state=random_state)
print(x_data.size, x_train.size, x_test.size)

22056704 16542528 5514176

In [44]:
regr.fit(x_train, y_train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=100,
                      n_jobs=None, oob_score=False, random_state=0, verbose=0,
                      warm_start=False)

In [45]:
y_pred = regr.predict(x_train)
rmse_random_forest_train = sqrt(mean_squared_error(y_train, y_pred))
print(rmse_random_forest_train)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_train.index.copy())
df_out_random_forest_train = pd.merge(school_and_crime_home_price_prediction, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_train)


y_pred = regr.predict(x_test)
rmse_random_forest_test = sqrt(mean_squared_error(y_test, y_pred))
print(rmse_random_forest_test)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = x_test.index.copy())
df_out_random_forest_test = pd.merge(school_and_crime_home_price_prediction, y_hats_df, how = 'left', left_index = True, right_index = True)

display(df_out_random_forest_test)


final_df_out_3 = df_out_random_forest_train['y_pred'].combine_first(df_out_random_forest_test['y_pred'])

display(final_df_out_3)

y_hats_df = pd.DataFrame(data = final_df_out_3, columns = ['y_pred'], index = df.index.copy())
display(y_hats_df)
final_df_out_3 = pd.merge(school_and_crime_home_price_prediction, y_hats_df, how = 'left', left_index = True, right_index = True)

display(final_df_out_3)

2396.177328860367

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,4.0,50800.0,NaN
1,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,5.0,50900.0,50978.00
2,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,6.0,51000.0,51026.00
3,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,7.0,51200.0,NaN
4,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,8.0,51500.0,51852.00
...,...,...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,5.0,805.0,NaN
2775641,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,6.0,795.0,NaN
2775642,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,7.0,789.0,794.80
2775643,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,8.0,786.0,NaN
2775644,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,9.0,787.0,791.65

5512.174393243889

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,4.0,50800.0,51130.00
1,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,5.0,50900.0,NaN
2,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,6.0,51000.0,NaN
3,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,7.0,51200.0,51367.00
4,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,8.0,51500.0,NaN
...,...,...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,5.0,805.0,810.18
2775641,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,6.0,795.0,799.67
2775642,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,7.0,789.0,NaN
2775643,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,8.0,786.0,792.85
2775644,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,9.0,787.0,NaN

0          51130.00
1          50978.00
2          51026.00
3          51367.00
4          51852.00
             ...
2775640      810.18
2775641      799.67
2775642      794.80
2775643      792.85
2775644      791.65
Name: y_pred, Length: 2757088, dtype: float64

          y_pred
0        51130.0
1        50978.0
2        51026.0
3        51367.0
4        51852.0
...          ...
2789789      NaN
2789790      NaN
2789791      NaN
2789792      NaN
2789793      NaN

[2789794 rows x 1 columns]

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month,index_value,y_pred
0,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,4.0,50800.0,51130.00
1,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,5.0,50900.0,50978.00
2,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,6.0,51000.0,51026.00
3,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,7.0,51200.0,51367.00
4,2.210884,44.65034,1.0,50.626531,58.024490,1.0,1996.0,8.0,51500.0,51852.00
...,...,...,...,...,...,...,...,...,...,...
2775640,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,5.0,805.0,810.18
2775641,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,6.0,795.0,799.67
2775642,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,7.0,789.0,794.80
2775643,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,8.0,786.0,792.85
2775644,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2019.0,9.0,787.0,791.65

In [46]:
query = "SELECT DISTINCT id FROM home_type"

available_home_type_ids = pd.read_sql(query, con=connection)

display(available_home_type_ids)

    id
0   11
1    8
2   19
3    4
4   14
5    3
6   17
7   13
8   10
9    9
10   7
11   1
12   5
13  18
14   2
15  16
16  15
17   6
18  12

In [47]:
query = "SELECT DISTINCT id FROM county"

available_county_ids = pd.read_sql(query, con=connection)

display(available_county_ids)

        id
0      790
1     2850
2     1798
3     1489
4     2335
...    ...
3129   536
3130  1715
3131   520
3132    55
3133   148

[3134 rows x 1 columns]

In [50]:
available_home_type_ids["key"] = 0
available_county_ids["key"] = 0

home_and_county_ids = pd.merge(available_home_type_ids, available_county_ids, on='key')

home_and_county_ids = home_and_county_ids.rename(columns={'id_x': 'home_type_ids', 'id_y': 'county_ids'})
display(home_and_county_ids)

       home_type_ids  key  county_ids
0                 11    0         790
1                 11    0        2850
2                 11    0        1798
3                 11    0        1489
4                 11    0        2335
...              ...  ...         ...
59541             12    0         536
59542             12    0        1715
59543             12    0         520
59544             12    0          55
59545             12    0         148

[59546 rows x 3 columns]

In [62]:
final_xtest_frame = final_df_out_3[(final_df_out_3["year"]==2019) & (final_df_out_3["month"]==9)]

In [63]:
final_xtest_frame["year"] = 2020

/Users/sanyamkhurana/domicilian-web/venv/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [68]:
del final_xtest_frame["y_pred"]
del final_xtest_frame["index_value"]

In [69]:
final_xtest_frame

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month
281,2.210884,44.65034,1.0,50.626531,58.024490,1.0,2020,9.0
563,2.210884,44.65034,1.0,50.626531,58.024490,2.0,2020,9.0
845,2.210884,44.65034,1.0,50.626531,58.024490,4.0,2020,9.0
1127,2.210884,44.65034,1.0,50.626531,58.024490,5.0,2020,9.0
1409,2.210884,44.65034,1.0,50.626531,58.024490,6.0,2020,9.0
...,...,...,...,...,...,...,...,...
2774689,1.650000,37.44000,3144.0,15.616667,24.066667,4.0,2020,9.0
2774971,1.650000,37.44000,3144.0,15.616667,24.066667,5.0,2020,9.0
2775253,1.650000,37.44000,3144.0,15.616667,24.066667,6.0,2020,9.0
2775535,1.650000,37.44000,3144.0,15.616667,24.066667,9.0,2020,9.0
2775644,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2020,9.0

In [70]:
x_train

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month
2322535,3.473684,67.457895,2657.0,20.100000,25.120000,4.0,2000.0,3.0
282033,3.333333,63.600000,342.0,20.000000,25.771429,3.0,2018.0,3.0
507262,2.200000,45.453333,605.0,27.883333,39.675000,9.0,2018.0,8.0
118349,2.200000,50.070000,149.0,15.780000,22.420000,3.0,2017.0,11.0
2488862,2.538462,54.692308,2829.0,19.020000,23.480000,9.0,1999.0,2.0
...,...,...,...,...,...,...,...,...
214426,2.833333,51.666667,262.0,40.125000,51.475000,9.0,2004.0,1.0
67025,4.129032,78.825806,87.0,11.814286,16.800000,5.0,2006.0,11.0
212269,4.000000,78.500000,260.0,24.600000,31.000000,3.0,2015.0,8.0
1112497,2.651685,51.294382,1291.0,27.138983,32.805085,9.0,2013.0,7.0
1888706,2.533333,47.000000,2135.0,24.583333,30.966667,5.0,2011.0,8.0

In [73]:
y_pred = regr.predict(final_xtest_frame)
y_hats_df = pd.DataFrame(data = y_pred, columns = ['y_pred'], index = final_xtest_frame.index.copy())
final_predictions = pd.merge(final_xtest_frame, y_hats_df, how = 'left', left_index = True, right_index = True)

display(final_predictions)

,schooldigger_rating,average_standard_score,county_id,violent_crime,property_crime,home_type_id,year,month,y_pred
281,2.210884,44.65034,1.0,50.626531,58.024490,1.0,2020,9.0,135541.00
563,2.210884,44.65034,1.0,50.626531,58.024490,2.0,2020,9.0,71798.00
845,2.210884,44.65034,1.0,50.626531,58.024490,4.0,2020,9.0,117991.00
1127,2.210884,44.65034,1.0,50.626531,58.024490,5.0,2020,9.0,293664.00
1409,2.210884,44.65034,1.0,50.626531,58.024490,6.0,2020,9.0,494424.00
...,...,...,...,...,...,...,...,...,...
2774689,1.650000,37.44000,3144.0,15.616667,24.066667,4.0,2020,9.0,259073.00
2774971,1.650000,37.44000,3144.0,15.616667,24.066667,5.0,2020,9.0,293405.00
2775253,1.650000,37.44000,3144.0,15.616667,24.066667,6.0,2020,9.0,352350.00
2775535,1.650000,37.44000,3144.0,15.616667,24.066667,9.0,2020,9.0,271708.00
2775644,1.650000,37.44000,3144.0,15.616667,24.066667,7.0,2020,9.0,791.65

In [74]:
final_predictions.to_sql('predicted_prices', con=engine, if_exists='append')